{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn_data_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn_data", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "True", 
        "momentum": "0.9"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 1], [4, 0, 1]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like0", 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max0", 
      "attrs": {"axis": "1"}, 
      "inputs": [[6, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort0", 
      "attrs": {"axis": "2"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add0", 
      "inputs": [[8, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max1", 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div0", 
      "inputs": [[9, 0, 0], [10, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort1", 
      "attrs": {"axis": "1"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add1", 
      "inputs": [[12, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max2", 
      "inputs": [[13, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div1", 
      "inputs": [[13, 0, 0], [14, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack0", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[11, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat0", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[5, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv0_weight", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv0", 
      "attrs": {
        "kernel": "(7, 7)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "pad": "(3, 3)", 
        "stride": "(2, 2)", 
        "workspace": "512"
      }, 
      "inputs": [[17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "bn0_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "bn0_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "bn0", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[19, 0, 0], [20, 0, 0], [21, 0, 0], [22, 0, 1], [23, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "relu0", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling0", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit1_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit1_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "DBstage1_unit1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "DBstage1_unit1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like1", 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max3", 
      "attrs": {"axis": "1"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort2", 
      "attrs": {"axis": "2"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add2", 
      "inputs": [[35, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max4", 
      "inputs": [[36, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div2", 
      "inputs": [[36, 0, 0], [37, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort3", 
      "attrs": {"axis": "1"}, 
      "inputs": [[34, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add3", 
      "inputs": [[39, 0, 0], [34, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max5", 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div3", 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack1", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[38, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat1", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[32, 0, 0], [43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit1_conv1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "DBstage1_unit1_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit1_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit1_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit1_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit1_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "DBstage1_unit1_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0], [49, 0, 1], [50, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "DBstage1_unit1_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like2", 
      "inputs": [[52, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max6", 
      "attrs": {"axis": "1"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort4", 
      "attrs": {"axis": "2"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add4", 
      "inputs": [[55, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max7", 
      "inputs": [[56, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div4", 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort5", 
      "attrs": {"axis": "1"}, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add5", 
      "inputs": [[59, 0, 0], [54, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max8", 
      "inputs": [[60, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div5", 
      "inputs": [[60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack2", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[58, 0, 0], [62, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat2", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[52, 0, 0], [63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit1_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "DBstage1_unit1_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "DBstage1_concat1", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[26, 0, 0], [66, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit2_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit2_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit2_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit2_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "DBstage1_unit2_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[67, 0, 0], [68, 0, 0], [69, 0, 0], [70, 0, 1], [71, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "DBstage1_unit2_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[72, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like3", 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max9", 
      "attrs": {"axis": "1"}, 
      "inputs": [[74, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort6", 
      "attrs": {"axis": "2"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add6", 
      "inputs": [[76, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max10", 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div6", 
      "inputs": [[77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort7", 
      "attrs": {"axis": "1"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add7", 
      "inputs": [[80, 0, 0], [75, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max11", 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div7", 
      "inputs": [[81, 0, 0], [82, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack3", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[79, 0, 0], [83, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat3", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[73, 0, 0], [84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit2_conv1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "DBstage1_unit2_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit2_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit2_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit2_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit2_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "DBstage1_unit2_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "DBstage1_unit2_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like4", 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max12", 
      "attrs": {"axis": "1"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort8", 
      "attrs": {"axis": "2"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add8", 
      "inputs": [[96, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max13", 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div8", 
      "inputs": [[97, 0, 0], [98, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort9", 
      "attrs": {"axis": "1"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add9", 
      "inputs": [[100, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max14", 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div9", 
      "inputs": [[101, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack4", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[99, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat4", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[93, 0, 0], [104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit2_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "DBstage1_unit2_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[105, 0, 0], [106, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "DBstage1_concat2", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[67, 0, 0], [107, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit3_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit3_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit3_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit3_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "DBstage1_unit3_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[108, 0, 0], [109, 0, 0], [110, 0, 0], [111, 0, 1], [112, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "DBstage1_unit3_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[113, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like5", 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max15", 
      "attrs": {"axis": "1"}, 
      "inputs": [[115, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort10", 
      "attrs": {"axis": "2"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add10", 
      "inputs": [[117, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max16", 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div10", 
      "inputs": [[118, 0, 0], [119, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort11", 
      "attrs": {"axis": "1"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add11", 
      "inputs": [[121, 0, 0], [116, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max17", 
      "inputs": [[122, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div11", 
      "inputs": [[122, 0, 0], [123, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack5", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[120, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat5", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[114, 0, 0], [125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit3_conv1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "DBstage1_unit3_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit3_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit3_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit3_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit3_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "DBstage1_unit3_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0], [130, 0, 0], [131, 0, 1], [132, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "DBstage1_unit3_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like6", 
      "inputs": [[134, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max18", 
      "attrs": {"axis": "1"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort12", 
      "attrs": {"axis": "2"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add12", 
      "inputs": [[137, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max19", 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div12", 
      "inputs": [[138, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort13", 
      "attrs": {"axis": "1"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add13", 
      "inputs": [[141, 0, 0], [136, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max20", 
      "inputs": [[142, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div13", 
      "inputs": [[142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack6", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[140, 0, 0], [144, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat6", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[134, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit3_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "DBstage1_unit3_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[146, 0, 0], [147, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "DBstage1_concat3", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[108, 0, 0], [148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit4_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit4_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit4_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit4_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "DBstage1_unit4_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[149, 0, 0], [150, 0, 0], [151, 0, 0], [152, 0, 1], [153, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "DBstage1_unit4_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like7", 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max21", 
      "attrs": {"axis": "1"}, 
      "inputs": [[156, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort14", 
      "attrs": {"axis": "2"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add14", 
      "inputs": [[158, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max22", 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div14", 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort15", 
      "attrs": {"axis": "1"}, 
      "inputs": [[157, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add15", 
      "inputs": [[162, 0, 0], [157, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max23", 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div15", 
      "inputs": [[163, 0, 0], [164, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack7", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[161, 0, 0], [165, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat7", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[155, 0, 0], [166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit4_conv1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "DBstage1_unit4_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit4_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit4_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit4_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit4_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "DBstage1_unit4_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0], [172, 0, 1], [173, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "DBstage1_unit4_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like8", 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max24", 
      "attrs": {"axis": "1"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort16", 
      "attrs": {"axis": "2"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add16", 
      "inputs": [[178, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max25", 
      "inputs": [[179, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div16", 
      "inputs": [[179, 0, 0], [180, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort17", 
      "attrs": {"axis": "1"}, 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add17", 
      "inputs": [[182, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max26", 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div17", 
      "inputs": [[183, 0, 0], [184, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack8", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[181, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat8", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[175, 0, 0], [186, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit4_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "DBstage1_unit4_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[187, 0, 0], [188, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "DBstage1_concat4", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[149, 0, 0], [189, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit5_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit5_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit5_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit5_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "DBstage1_unit5_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[190, 0, 0], [191, 0, 0], [192, 0, 0], [193, 0, 1], [194, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "DBstage1_unit5_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[195, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like9", 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max27", 
      "attrs": {"axis": "1"}, 
      "inputs": [[197, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort18", 
      "attrs": {"axis": "2"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add18", 
      "inputs": [[199, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max28", 
      "inputs": [[200, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div18", 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort19", 
      "attrs": {"axis": "1"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add19", 
      "inputs": [[203, 0, 0], [198, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max29", 
      "inputs": [[204, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div19", 
      "inputs": [[204, 0, 0], [205, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack9", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[202, 0, 0], [206, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat9", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[196, 0, 0], [207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit5_conv1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "DBstage1_unit5_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit5_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit5_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit5_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit5_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "DBstage1_unit5_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[210, 0, 0], [211, 0, 0], [212, 0, 0], [213, 0, 1], [214, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "DBstage1_unit5_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like10", 
      "inputs": [[216, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max30", 
      "attrs": {"axis": "1"}, 
      "inputs": [[217, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort20", 
      "attrs": {"axis": "2"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add20", 
      "inputs": [[219, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max31", 
      "inputs": [[220, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div20", 
      "inputs": [[220, 0, 0], [221, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort21", 
      "attrs": {"axis": "1"}, 
      "inputs": [[218, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add21", 
      "inputs": [[223, 0, 0], [218, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max32", 
      "inputs": [[224, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div21", 
      "inputs": [[224, 0, 0], [225, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack10", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[222, 0, 0], [226, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat10", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[216, 0, 0], [227, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit5_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "DBstage1_unit5_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[228, 0, 0], [229, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "DBstage1_concat5", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[190, 0, 0], [230, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit6_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit6_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit6_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit6_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "DBstage1_unit6_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[231, 0, 0], [232, 0, 0], [233, 0, 0], [234, 0, 1], [235, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "DBstage1_unit6_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[236, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like11", 
      "inputs": [[237, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max33", 
      "attrs": {"axis": "1"}, 
      "inputs": [[238, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort22", 
      "attrs": {"axis": "2"}, 
      "inputs": [[239, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add22", 
      "inputs": [[240, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max34", 
      "inputs": [[241, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div22", 
      "inputs": [[241, 0, 0], [242, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort23", 
      "attrs": {"axis": "1"}, 
      "inputs": [[239, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add23", 
      "inputs": [[244, 0, 0], [239, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max35", 
      "inputs": [[245, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div23", 
      "inputs": [[245, 0, 0], [246, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack11", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[243, 0, 0], [247, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat11", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[237, 0, 0], [248, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit6_conv1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "DBstage1_unit6_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[249, 0, 0], [250, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit6_bn2_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit6_bn2_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit6_bn2_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit6_bn2_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "DBstage1_unit6_bn2", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[251, 0, 0], [252, 0, 0], [253, 0, 0], [254, 0, 1], [255, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "DBstage1_unit6_relu2", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[256, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like12", 
      "inputs": [[257, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max36", 
      "attrs": {"axis": "1"}, 
      "inputs": [[258, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort24", 
      "attrs": {"axis": "2"}, 
      "inputs": [[259, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add24", 
      "inputs": [[260, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max37", 
      "inputs": [[261, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div24", 
      "inputs": [[261, 0, 0], [262, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort25", 
      "attrs": {"axis": "1"}, 
      "inputs": [[259, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add25", 
      "inputs": [[264, 0, 0], [259, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max38", 
      "inputs": [[265, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div25", 
      "inputs": [[265, 0, 0], [266, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack12", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[263, 0, 0], [267, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat12", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[257, 0, 0], [268, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "DBstage1_unit6_conv2_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "DBstage1_unit6_conv2", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[269, 0, 0], [270, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "DBstage1_concat6", 
      "attrs": {"num_args": "2"}, 
      "inputs": [[231, 0, 0], [271, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "TBstage1_bn1_gamma", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "TBstage1_bn1_beta", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "TBstage1_bn1_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "TBstage1_bn1_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "TBstage1_bn1", 
      "attrs": {
        "eps": "2e-05", 
        "fix_gamma": "False", 
        "momentum": "0.9"
      }, 
      "inputs": [[272, 0, 0], [273, 0, 0], [274, 0, 0], [275, 0, 1], [276, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "TBstage1_relu1", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[277, 0, 0]]
    }, 
    {
      "op": "ones_like", 
      "name": "ones_like13", 
      "inputs": [[278, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max39", 
      "attrs": {"axis": "1"}, 
      "inputs": [[279, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort26", 
      "attrs": {"axis": "2"}, 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add26", 
      "inputs": [[281, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max40", 
      "inputs": [[282, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div26", 
      "inputs": [[282, 0, 0], [283, 0, 0]]
    }, 
    {
      "op": "argsort", 
      "name": "argsort27", 
      "attrs": {"axis": "1"}, 
      "inputs": [[280, 0, 0]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "elemwise_add27", 
      "inputs": [[285, 0, 0], [280, 0, 0]]
    }, 
    {
      "op": "max", 
      "name": "max41", 
      "inputs": [[286, 0, 0]]
    }, 
    {
      "op": "broadcast_div", 
      "name": "broadcast_div27", 
      "inputs": [[286, 0, 0], [287, 0, 0]]
    }, 
    {
      "op": "stack", 
      "name": "stack13", 
      "attrs": {
        "axis": "1", 
        "num_args": "2"
      }, 
      "inputs": [[284, 0, 0], [288, 0, 0]]
    }, 
    {
      "op": "Concat", 
      "name": "concat13", 
      "attrs": {
        "dim": "1", 
        "num_args": "2"
      }, 
      "inputs": [[278, 0, 0], [289, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "TBstage1_conv1_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "TBstage1_conv1", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)", 
        "workspace": "512"
      }, 
      "inputs": [[290, 0, 0], [291, 0, 0]]
    }, 
    {
      "op": "Pooling", 
